# St7SetPropertyColour

Sets the colour of the specified property.

long St7SetPropertyColour(long uID, long Entity, long PropNum, long PropCol)

Input Parameters

uID

Strand7 model file ID.

Entity

One of ptBEAMPROP, ptPLATEPROP, ptBRICKPROP or ptPLYPROP.

PropNum

Property number.

PropCol

Property colour. See also RGB Colours.